<template>
  <div class="mh100vh bcf bcf9">
    <headmenu ref="head" :index="1"></headmenu>
    <div class="vih lh50p">&nbsp;</div>
    <div class="mr15">
      <div class="tc font36 pt2"> CPU Education用户使用协议</div>
      <div class="pt2 lh36p font22 tl">
        <div class="font20 lh36p">
          欢迎您使用CPU Education（cpu-edu.com）服务（下称：本服务）
          请您仔细阅下方条款，若您对本协议的任何条款存有异议，您可以第一时间选择不进入CPU。

        </div>
        <div class="font20 lh36p">当您借助微信提供的开放平台二维码扫码成功，在进入CPU后上发布的任何内容均意味着您（即用户）完全接受本协议项下的全部条款。
          在登录界面扫码并成功登录后，即表示您已充分阅读、理解并接受本协议项下的全部内容，并与CPU达成本协议。</div>
        <div class="font20 lh36p">CPU（cpu-edu.com）有权随时对本协议进行修改，用户在登录使用前如果不同意本协议的修改，可以放弃使用或访问本网站，如果用户选择在本协议变更后继续访问或使用本网站，则视为用户已经接受本协议的修改。</div>
      </div>

      <div class="tl font36 pt4">使用规则</div>
      <div class="pt2 lh36p font22 tl">
        <div class="font20 lh36p">
          <li>1. 用户登录成功后，用户应当对帐号所进行的所有活动和事件负法律责任。</li>
          <li>2. 用户须对在CPU的信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；不得恶意传播账号独有的学习资源；否则CPU有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任。</li>
          <li>3. 用户不应将其帐号转让或出借予他人使用。如用户发现其帐号遭他人非法使用，应立即通知CPU。因黑客行为或用户的保管疏忽导致帐号遭他人非法使用，CPU不承担任何责任。</li>
          <li>4. 用户必须同意接受CPU通过电子邮件或其他方式向用户发送商品促销或其他相关商业信息。</li>
          <li>5. 用户理解，CPU需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成网络服务在合理时间内的中断，CPU无需为此承担任何责任，但应尽可能事先进行通告。</li>
          <li>6. 用户同意保障和维护CPU及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给CPU或任何其他第三方造成损失，用户同意承担由此造成的损害赔偿责任。</li>
        </div>
      </div>

      <div class="tl font36 pt4">用户行为</div>
      <div class="pt2 lh36p font22 tl">
        <div class="font20 lh36p">
          <li>1. 用户应遵守中华人民共和国相关法律法规，并同意对以任何方式使用用户账号而使用本服务的任何行为及其结果承担全部责任。如用户的行为违反国家法律，用户将依法承担全部法律责任；如涉嫌构成犯罪，司法机关将追究用户的刑事责任，CPU将严格按照法律规定的义务及司法机关的要求进行配合。同时，如果CPU有理由认为用户的任何行为，包括但不限于用户的任何言论或其它行为违反或可能违反国家法律法规的任何规定，CPU可在任何时候不经任何事先通知终止向用户提供服务。</li>
          <li>2. 用户应遵守所有与CPU服务有关的网络协议、规定和程序。</li>
          <li>3. 用户同意将不会利用CPU上传、复制、发布、传播或者转载如下内容：</li>
          <ul>
            <li>反对宪法所确定的基本原则的；</li>
            <li>危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</li>
            <li>损害国家荣誉和利益的；</li>
            <li>煽动民族仇恨、民族歧视，破坏民族团结的；</li>
            <li>侮辱、滥用英烈形象，否定英烈事迹，美化粉饰侵略战争行为的；</li>
            <li>破坏国家宗教政策，宣扬邪教和封建迷信的；</li>
            <li>散布谣言，扰乱社会秩序，破坏社会稳定的；</li>
            <li>散布淫秽、赌博、暴力、凶杀、自残、恐怖或者教唆犯罪的；</li>
            <li>侮辱或者诽谤他人，侵害他人合法权益（如名誉权、肖像权等）的；</li>
            <li>侵害他人知识产权、商业秘密等合法权利的；</li>
            <li>虚构事实、隐瞒真相以误导、欺骗他人的；</li>
            <li>发布、传送、传播广告信息及垃圾信息的；</li>
            <li>其他法律法规禁止的行为。</li>
          </ul>
          <li>4. 不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益。</li>
          <li>5. 如用户在使用网络服务时违反任何上述规定，CPU或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。</li>
        </div>
      </div>

      <div class="tl font36 pt4">知识产权</div>
      <div class="pt2 lh36p font22 tl">
        <div class="font20 lh36p">
          <li>1. 在CPU (cpu-edu.com)上发表的全部原创内容（包括但不仅限于作品、文章、评论、音频和视频），著作权均归CPU所有，任何商业用途均须联系CPU。临摹作品、转载作品、同人作品原型版权归CPU所有。</li>
          <li>2. CPU提供的网络服务中包含的版面设计、文本、标识、图片、图形等均受著作权、商标权及其它法律保护，未经相关权利人（含CPU 及其他原始权利人）同意，上述内容均不得在任何平台被直接或间接发布、使用、出于发布或使用目的的改写或再发行，或被用于其他任何商业目的</li>
          <li>3. 为了促进知识的分享和传播，用户将其在CPU所属平台上发表的全部内容，授予CPU免费的、不可撤销的、非独家使用许可，CPU有权将该内容用于CPU各种形态的产品和服务上，包括但不限于网站以及发表的应用或其他互联网产品。</li>
          <li>4. 第三方若出于非商业目的，将CPU上发布的内容转载在CPU (cpu-edu.com)之外的地方，应当在作品的正文开头的显著位置注明CPU（或原作者在CPU所属平台上使用的帐号名称），给出原始链接，注明「转载于CPU」，并不得对作品进行修改演绎。若需要对作品进行修改，或用于商业目的，第三方应当联系CPU获得单独授权，按照用户规定的方式使用该内容。</li>
          <li>5. 在CPU所属平台上传或发表的内容，用户应保证其为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益。如果第三方提出关于著作权的异议，CPU有权根据实际情况删除相关的内容，且有权追究用户的法律责任。给CPU或任何第三方造成损失的，用户应负责全额赔偿。</li>
          <li>6. 如果任何第三方侵犯了CPU用户相关权利，用户同意授权CPU或其指定的代理人代表CPU自身或用户对该第三方提出警告、投诉、发起行政执法、诉讼、进行上诉，或谈判和解，并且用户同意在CPU认为必要的情况下参与共同维权。</li>
          <li>7. CPU有权但无义务对用户发布的内容进行审核，有权根据相关证据结合《侵权责任法》、《信息网络传播权保护条例》等法律法规对侵权信息进行处理。</li>
          <li>8. CPU为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图象、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程、反向编译或反汇编。</li>
        </div>
      </div>

      <div class="tl font36 pt4">隐私保护</div>
      <div class="pt2 lh36p font22 tl">
        <div class="font20 lh36p">
          <li>1. 保护用户个人信息安全既是法律要求，也是CPU长期坚持的一项基本原则。CPU保证不对外公开或向第三方提供单个用户的注册资料及用户在使用CPU服务时存储在网站的非公开内容，但下列情况除外：</li>
          <ul>
            <li>事先获得用户的明确授权；</li>
            <li>根据有关的法律法规要求；</li>
            <li>按照相关政府主管部门的要求；</li>
            <li>为维护社会公众的利益；</li>
            <li>为维护网站的合法权益。</li>
          </ul>
          <li>2. CPU可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与CPU同等的保护用户隐私的责任，则网站有权将用户的注册资料等提供给该第三方。</li>
          <li>3. 在不透露单个用户隐私资料的前提下，CPU有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</li>
          <li>4. 您使用或继续使用我们的服务，即意味着同意我们按照CPU《隐私政策》收集、使用、储存和分享您的相关信息。详情请参见CPU《隐私政策》。</li>
        </div>
      </div>

      <div class="tl font36 pt4">免责声明</div>
      <div class="pt2 lh36p font22 tl">
        <div class="font20 lh36p">
          <li>1. 用户明确同意其使用CPU服务所存在的风险将完全由其自己承担；因其使用CPU服务而产生的一切后果也由其自己承担，CPU对用户不承担任何责任。</li>
          <li>2. CPU不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</li>
          <li>3. CPU不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由CPU实际控制的任何网页上的内容，网站不承担任何责任。</li>
          <li>4. 对于因不可抗力或不能控制的原因造成的网络服务中断或其它缺陷，CPU不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</li>
          <li>5. 用户同意，对于CPU向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，CPU无需承担任何责任：</li>
          <ul>
            <li>向用户免费提供的各项网络服务；</li>
            <li>向用户赠送的任何产品或者服务；</li>
            <li>向收费网络服务用户附赠的各种产品或者服务。</li>
          </ul>
        </div>
      </div>

      <div class="tl font36 pt4">协议修改</div>
      <div class="pt2 lh36p font22 tl">
        <div class="font20 lh36p">
          <li>1. 根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，CPU有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，CPU将会直接在网站上公布修改之后的协议内容，该公布行为视为CPU已经通知用户修改内容。CPU也可采用电子邮件或私信的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。</li>
          <li>2. 如果不同意CPU对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受CPU对本协议相关条款所做的修改。</li>
          <li>3. 本协议项下CPU对于用户所有的通知均可通过网页公告、电子邮件、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。</li>
          <li>4. 用户对于CPU的通知应当通过网站对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。</li>
        </div>
      </div>

      <div class="tl font36 pt4">其他规定</div>
      <div class="pt2 lh36p font22 tl">
        <div class="font20 lh36p">
          <li>1. 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向CPU所在地的人民法院提起诉讼。</li>
          <li>2. 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。</li>
          <li>3. 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</li>
          <li>4. 本协议中的标题仅为方便而设，在解释本协议时应被忽略。</li>
        </div>
      </div>

      <div class="vih lh100p">&nbsp;</div>
    </div>
    <foote ref="foote"></foote>
  </div>
</template>

<script>
import Vue from 'vue';
import headmenu from '../../components/headmenu.vue';
import foote from '../../components/foote.vue';

export default {
  data () {
    return {
      bean: '',
      id: ''
    };
  },

  created () {
    this.id = this.$route.query.p_n_id;
    this.getData()
  },
  components: {
    headmenu: headmenu,
    foote: foote
  },
  methods: {
    getData () {
      // alert(this.p_n_id);
      let postData = {
        p_n_id: this.id
      };
      // bannerDetail(postData).then(res => {
      //   // console.log(res)
      //   this.bean = res
      // });

    },
  },
};
</script>
<style>
@import "../../common/css/common.css";
</style>